Repository: Mahmoud-Ismail10/E-CommerceProjectCleanArchitecture
Catalog: E-Commerce.Core/Resources/SharedResources.*.resx
Languages: ar

# Created
source: Created Successfully
ar: تم الاضافه بنجاح

# Deleted
source: Deleted Successfully
ar: تم الحذف بنجاح

# NotFound
source: The object is not found
ar: الكائن غير موجود

source: Bad Request
ar: هذا الطلب لا يمكن فهمه

# UnprocessableEntity
source: There are Validation Errors or Syntax Errors
ar: يوجد مشاكل في صيغة الداتا او نوعها عن المطلوب

# Required
source: This Field is Required
ar: هذا الحقل مطلوب

# Success
source: The operation was successful
ar: تمت العمليه بنجاح

# UnAuthorized
source: You are not authorized to access this resources
ar: لا تملك الصلاحية للوصول لتلك المصادر

# Updated
source: Updated Successfully
ar: تم التعديل بنجاح

source: Price
ar: السعر

source: StockQuantity
ar: كميه المخزون

source: CategoryId
ar: معرف الفئه

source: Name
ar: الاسم

# NotEmpty
source: This field must not be empty
ar: لا يجب أن يكون هذا الحقل فارغًا

# MaxLengthIs100
source: Max Length cannot exceed 100 characters.
ar: لا يمكن أن يتجاوز طول الحد الأقصى 100 حرف.

# MaxLengthIs300
source: Max Length cannot exceed 300 characters.
ar: لا يمكن أن يتجاوز طول الحد الأقصى 300 حرف.

# IsExist
source: Is already exists
ar: هذا الكائن موجود بالفعل

# IsNotExist
source: does not exist
ar: غير موجود

# MinLengthIs6
source: Min Length cannot less than 6 characters.
ar: لا يمكن أن تقل الطول عن 6 احرف.

# InvalidFormat
source: Format is Invalid
ar: تنسيق غير صالح

# InvalidPassword
source: Password is Invalid
ar: كلمة المرور غير صحيحه

# PasswordsDoNotMatch
source: Confirm password is not match to Password
ar: تأكيد كلمة المرور غير متطابقة مع كلمة المرور

source: FirstName
ar: الاسم الاول

source: LastName
ar: الاسم الاخير

source: UserName
ar: اسم المستخدم

source: Email
ar: الايميل

source: Password
ar: كلمه المرور

source: ConfirmPassword
ar: تأكيد كلمة المرور

# MaxLengthIs200
source: Max Length cannot exceed 200 characters.
ar: لا يمكن أن يتجاوز طول الحد الأقصى 200 حرف.

# GreaterThanZero
source: Must be greater than zero
ar: يجب ان يكون اكبر من الصفر

# EmailIsExist
source: This email already exists
ar: هذا الايميل موجود بالفعل

# UserNameIsExist
source: This UserName already exists
ar: اسم المستخدم هذا موجود بالفعل

# UserNameIsNotExist
source: This UserName does not exists
ar: اسم المستخدم هذا غير موجود

# EmailIsNotConfirmed
source: Your Email is not confirmed, Please Confirm it
ar: الايميل الخاص بك ليس مؤكدًا، من فضلك بتأكيده

source: RoleName
ar: اسم الصلاحية

# UpdateFailed
source: Update Opetation is Failed
ar: حدث خطأ أثناء تحديث البيانات

# DeleteFailed
source: Delete Opetation is Failed
ar: حدث خطأ أثناء حذف البيانات

# CreateFailed
source: Create Opetation is Failed
ar: حدث خطأ أثناء اضافة البيانات

# PasswordChangedSuccessfully
source: The password has been successfully changed
ar: تم تغيير كلمة المرور بنجاح

source: CurrentPassword
ar: كلمة المرور الحاليه

source: NewPassword
ar: كلمة المرور الجديدة

source: Algorithm Is Wrong
ar: هناك خطأ في الخوارزمية المستخدمة في التشفير

source: Token Is Not Expired
ar: رمز الوصول الذي تستخدمة ليس منتهي

source: Refresh Token Is Not Found
ar: رمز التنشيط الذي تستخمه ليس موجود

source: Refresh Token Is Expired
ar: رمز التنشيط الذي تستخمه انتهت صلاحية

source: Token Is Expired
ar: رمز الوصول الذي تستخدمة منتهي الصلاحية

source: RoleId
ar: معرف الصلاحية

# RoleIsUsed
source: The Role is used by users
ar: الصلاحية مستخدمه من قبل مستخدمين بالفعل

# FailedToRemoveOldRoles
source: Operation is Failed To Remove Old Roles
ar: فشلت عملية حذف الصلاحيات القديمة

# FailedToAddNewRoles
source: Operation is Failed To Add User Roles
ar: فشلت عملية اضافة صلاحيات جديدة للمستخدم

# FailedToUpdateUserRoles
source: Operation is Failed To Update User Roles
ar: فشلت عملية تحديث الصلاحيات للمستخدم

# FailedToRemoveOldClaims
source: Operation is Failed To Remove Old Claims
ar: فشلت عملية حذف صلاحيات الاستخدام القديمة

# FailedToAddNewClaims
source: Operation is Failed To Add User Claims
ar: فشلت عملية اضافة صلاحيات استخدام جديدة للمستخدم

# FailedToUpdateUserClaims
source: Operation is Failed To Update User Claims
ar: فشلت عملية تحديث الصلاحيات الاستخدام للمستخدم

source: Message
ar: الرسالة

# SendEmailFailed
source: Operation to send email failed
ar: حدث خطأ اثناء ارسال الايميل

# TryToRegisterAgain
source: Operation Is Failed, Try To Register Again
ar: حدث خطأ غير متوقع اعد المحاولة مره اخري

# UserOrCodeIsNullOrEmpty
source: Error Occure When Confirm Email, User or Code is Null or Empty
ar: حدث خطأ أثناء تأكيد الايميل، معرف المستخدم او الكود غير موجود او فارغ

source: Confirm Email Done
ar: تم تأكيد الايميل بنجاح

# UserNotFound
source: This User Is Not Found
ar: هذا المستخدم غير موجود

# TryAgainLater
source: Error Occure, Try Again Later
ar: حدث خطأ، حاول في وقت لاحق

source: Invaild Code
ar: هذا الكود غير صحيح

source: Code
ar: الكود

source: Failed To Upload Image
ar: حدث خطأ أثناء رفع الصورة

# NoImage
source: Please Select Image
ar: من فضلك قم بإضافة صورة

source: Street
ar: الشارع

source: City
ar: المدينة

source: State
ar: المحافظة

# ShippingAddressIsExist
source: This Shipping Address already exists
ar: عنوان الشحن هذا موجود بالفعل

source: ProductId
ar: معرف المنتج

source: Quantity
ar: الكمية

source: PaymentMethod
ar: طريقة الدفع

source: DeliveryMethod
ar: طريقة التوصيل

source: ShippingAddressId
ar: معرف عنوان الشحن

source: Failed in discount quantity from stock
ar: فشل في الخصم من كمية المخزون

source: Failed in payment processing
ar: فشل في عملية الدفع

source: Failed in delivery processing
ar: فشل في عملية اعداد التوصيل

source: CartId
ar: معرف السلة

# CartNotFoundOrEmpty
source: This Cart is not found or empty.
ar: هذه السلة غير موجودة أو فارغة

# InvalidCombination
source: Invalid payment and delivery combination.
ar: لا يصلح اختيارك لطريقة الدفع مع طريقة الشحن.

# CannotSelectShippingAddress
source: You cannot select a shipping address if you will pickup the order from the branch.
ar: لا يمكنك تحديد عنوان الشحن إذا كنت ستستلم الطلب من الفرع.

source: Failed to modify this cart.
ar: فشل في تعديل هذه السلة.

# AddedToCart
source: Added To The Cart Successfully
ar: تمت الإضافة إلى السلة بنجاح

# ProductNotFound
source: Product Is Not Found
ar: المنتج غير موجود

source: An Error Occurred While Adding To The Cart
ar: حدث خطأ أثناء الإضافة إلى السلة

# ItemNotFoundInCart
source: This item was not found in your cart.
ar: لم يتم العثور على هذا المنتج في السلة الخاصه بك

# ItemRemovedFromCart
source: Item Removed From The Cart Successfully.
ar: تمت إزالة المنتج من السلة بنجاح.

source: An Error Occurred While Removing From The Cart.
ar: حدث خطأ أثناء ازالة المنتج من السلة.

# ItemQuantityUpdated
source: Item Quantity Updated Successfully.
ar: تم تحديث كمية المنتج بنجاح.

source: An Error Occurred While Updating Item Quantity.
ar: حدث خطأ أثناء تحديث كمية المنتج.

# PleaseLoginFirst
source: Please log in first, so that you can add the order.
ar: يرجى تسجيل الدخول أولاً ، بحيث يمكنك إضافة الطلب.

source: Transaction Failed To Commit
ar: فشلت عملية حفظ التعديلات

# FailedInMigrateGuestCartToCustomer
source: Failed In Migrate Guest Cart Id To Customer Id
ar: فشل في تحويل معرف سلة كضيف إلى معرف كمستخدم

source: Failed To Delete GuestId Cookie
ar: فشل في حذف ملف تعريف الارتباط الخاص بـ الضيف

# ItemAlreadyExistsInCart
source: This Item is already in the cart.
ar: هذا العنصر موجود بالفعل في السلة.

# FailedInDeletingCart
source: Failed In Deleting The Cart
ar: فشل في حذف السلة

source: Shipping Address Does Not Exist
ar: عنوان الشحن غير موجود

# OrderNotFound
source: The Order Is Not Found
ar: الطلب غير موجود

source: Paymob Iframe ID Is Not Configured
ar: لم يتم تكوين الصفحة الخاصه بعملية الدفع

source: Payment Token Cannot Be Null Or Empty
ar: لا يمكن أن يكون رمز الدفع فارغًا أو غير موجود

# NoCustomerFoundForOrder
source: No Customer Found For This Order
ar: لا يوجد عميل لهذا الطلب

source: Failed To Update Order After Payment Creation
ar: فشل في تحديث الطلب بعد انشاء عملية الدفع

source: Invalid Paymob Integration ID In Configuration
ar: معرف التكامل الخاص بعملية الدفع غير صالح بالتكوين

# FailedToProcessPaymentForOrder
source: Failed To Process Payment For This Order
ar: فشل في عملية الدفع لهذا الطلب

source: InvalidOrder
ar: الطلب غير صالح

source: OrderId
ar: معرف الطلب

source: Payment Method Not Selected
ar: لم يتم تحديد طريقة الدفع

source: Shipping Address Is Required For Home Delivery
ar: عنوان الشحن مطلوب لتسليم المنازل

source: Failed To Persist Online Payment Data
ar: فشل في استمرار بيانات الدفع عبر الإنترنت

source: Failed To Confirm COD Order
ar: فشل في تأكيد طلب الدفع عن طريق الشحن

source: Error In Placed Order
ar: فشل في حجز الطلب

source: InvalidPayload
ar: محتوى غير صحيح

# PaymentNotFound
source: The Payment Is Not Found
ar: لم يتم العثور على عملية الدفع

source: Failed To Update Order
ar: فشل تحديث الطلب

source: Failed To Delete Cart After Order Success
ar: فشل حذف السلة بعد نجاح الطلب

source: Payment Intent Id Missing
ar: معرف اذن الدفع مفقود

source: Error Processing Server Callback
ar: خطأ في معالجة استدعاء الخادم

source: Invalid Callback Data
ar: بيانات استرجاع غير صالحة

source: Failed To Send Order Confirmation Email
ar: فشل في إرسال بريد إلكتروني لتأكيد الطلب

source: Invalid HMAC
ar: رمز HMAC غير صالح

# CategoryNotFound
source: This Category Is NotFound
ar: هذه الفئه غير موجوده

source: Id
ar: المعرف

# ReviewNotFound
source: This Review Is Not Found
ar: لم يتم العثور على هذه المراجعة

source: FailedToMarkNotifyAsRead
ar: فشل في جعل الاشعار مقروء

source: Failed To Mark All Notifications As Read
ar: فشل في جعل جميع الاشعارات مقروءة
